from collections import defaultdict
from utils import zipfile_reader, school_parser


def _zipfile_reader(filename):
    import itertools

    yield from itertools.islice(zipfile_reader(filename), 5)


if __name__ == "__main__":
    attrs = defaultdict(int)
    for filename, content in zipfile_reader("data/109.zip"):
        d = school_parser(content)
        for name in d:
            attrs[name] += 1

    # print(sorted(attrs.items(), key=lambda x: x[1], reverse=True))
    # 109: [('index', 2154), ('name', 2154), ('審查資料', 2044), ('面試', 1477), ('口試', 110), ('筆試', 37), ('面談', 35), ('團體面試', 30), ('高中在校排名', 24), ('高中成績綜合審查', 24), ('(無)', 16), ('團體面談及認識本系', 11), ('英文面試', 9), ('小論文筆試', 8), ('個別面談', 8), ('主修', 8), ('APCS', 7), ('英語面試', 7), ('認識本系與心得報告', 7), ('數學筆試', 6), ('物理筆試', 6), ('創意設計', 6), ('團體面談', 5), ('英文考試', 5), ('作品集面試', 5), ('團體體驗活動', 5), ('化學學科筆試', 4), ('政治時事議題分析', 3), ('綜合筆試(A)', 3), ('綜合筆試(B)', 3), ('作文', 3), ('語文能力測驗', 3), ('歐洲史地筆試', 3), ('美工術科', 3), ('設計與繪畫', 3), ('評估測驗', 3), ('英文作文筆試', 2), ('化學筆試', 2), ('化學+生物筆試', 2), ('化學+生物實作', 2), ('小論文', 2), ('術科', 2), ('筆試(數學相關知識)', 2), ('認識本系及筆試', 2), ('生物科筆試', 2), ('作文與翻譯筆試', 2), ('英文筆試', 2), ('英語口試', 2), ('互動式座談與評量', 2), ('筆試(數學一)', 2), ('筆試(數學二)', 2), ('互動式面談及筆試', 2), ('團體面談(含考試)', 2), ('團體面談及綜合筆試', 2), ('基本設計', 2), ('人際溝通(活動測試)', 2), ('面談與科學觀念測驗', 2), ('英文口試', 2), ('英語朗讀', 2), ('英語會話', 2), ('認識本系與邏輯測驗', 2), ('認識本系與創意表現', 2), ('英文作文翻譯筆試', 2), ('原作審查', 2), ('成果作品集', 2), ('面試：現場實作及口試', 2), ('團體訪談與認識本系', 2), ('寫作筆試', 1), ('語文測驗筆試', 1), ('英語口試測驗', 1), ('英語聽力測驗筆試', 1), ('哲學思考筆試', 1), ('生物+化學', 1), ('化學', 1), ('生物', 1), ('職能治療概論', 1), ('生物學綜合筆試', 1), ('數學筆試或程式設計', 1), ('筆試成績', 1), ('語文測驗筆試－白話文', 1), ('語文測驗筆試－文言文', 1), ('筆試一', 1), ('筆試二', 1), ('物理測驗', 1), ('設計素描', 1), ('聲音及肢體表現', 1), ('國文能力測驗', 1), ('英文讀寫能力', 1), ('筆試(土木相關知識)', 1), ('英文寫作能力測驗', 1), ('數學學科筆試', 1), ('物理科筆試', 1), ('數學科筆試', 1), ('地球科學筆試', 1), ('面試(含測驗)', 1), ('設計營', 1), ('英文文法、閱讀與寫作', 1), ('物理學科筆試', 1), ('觀察報告', 1), ('經濟筆試', 1), ('語文能力測驗筆試', 1), ('國際現勢筆試', 1), ('中英文口試', 1), ('英文朗誦與閱讀', 1), ('中英文面試', 1), ('團體面試及認識本學系', 1), ('英文短文翻譯', 1), ('設計', 1), ('基礎設計', 1), ('筆試:適性測驗', 1), ('面試（主修樂器考試）', 1), ('英語讀寫能力', 1), ('互動式面談', 1), ('互動式面談與評量', 1), ('團體面談(含筆試)', 1), ('團體面談 (含筆試)', 1), ('認識本系及綜合筆試', 1), ('團體面談即席心得測驗', 1), ('團體面談及即席測驗', 1), ('團體面談及個案分析', 1), ('成果作品', 1), ('面試(含審查資料)', 1), ('作文筆試', 1), ('團體面試及筆試', 1), ('歌唱與口語能力測驗', 1), ('基本體能', 1), ('體適能', 1), ('筆試-影像基本常識', 1), ('筆試-新聞分析', 1), ('筆試-廣告基本常識', 1), ('化學能力測驗', 1), ('生物科能力鑑定', 1), ('相關創意設計作品', 1), ('在校成績', 1), ('文章書面評論(筆試)', 1), ('閱讀翻譯與寫作', 1), ('主修原始成績', 1), ('化學科筆試', 1), ('專長測驗', 1), ('面試(含寫作)', 1), ('術科(素描)', 1), ('術科(雕塑)', 1), ('英文寫作', 1), ('面試(含術科考試)', 1), ('團體面談及心得報告', 1), ('主修術科考試成績', 1), ('特教議題小論文筆試', 1), ('台語口試', 1), ('術科筆試:創意表現', 1), ('術科專長測驗', 1), ('筆試(電腦概論)', 1), ('創意素描', 1), ('創作與詮釋', 1), ('國語文筆試', 1), ('認識本系及座談', 1), ('口語表達', 1), ('語文測驗', 1), ('英文會話', 1), ('英文朗讀', 1), ('現場繪畫', 1), ('筆試：作文', 1), ('筆試：語文能力測驗', 1), ('英文作文與閱讀測驗', 1), ('物理實驗筆試', 1), ('筆試(化學能力測驗)', 1), ('生物學科筆試', 1), ('即席演講', 1), ('專長陳述及成果作品', 1), ('即興表演', 1), ('個人專長才藝', 1), ('聲音與肢體表情測驗', 1), ('面試及原作品審查', 1), ('塑造', 1), ('造型設計', 1), ('創作作品集審查', 1), ('中國舞基本動作', 1), ('芭蕾基本動作', 1), ('現代舞基本動作', 1), ('舞蹈即興', 1), ('英文作文與翻譯', 1), ('評估測驗及認識本系', 1), ('面試與音樂素養展現', 1), ('面試與藝術表演', 1), ('專長術科測驗', 1), ('面試及認識本系', 1), ('筆試(創意思考)', 1), ('團體面談及系所介紹', 1), ('團體訪談', 1)]
